# TAREA 2do parcial
#### Martha Paola Álvarez Pérez

#### 1-4: Pandas (concatenación)

In [92]:
import pandas as pd

In [134]:
#  Ejercicio 1:
# Crea dos DataFrame que compartan la misma estructura de columnas (por ejemplo, 'Nombre' y 'Edad'), con al menos 3 filas cada uno. Concaténalos verticalmente en un único DataFrame. Retorna el DataFrame resultante.

def ex1_concat_same_structure():

    Datos = {
        'Nombre': ['Pao', 'Pau', 'Mech', 'Ani K.'],
        'Edad': [21, 20, 20, 23]
    }

    Datos2 = {
        'Nombre': ['Tom Holland', 'Josh', 'Ran', 'Diego Luna'],
        'Edad': [23, 20, 22, 22]
    }

    df1 = pd.DataFrame(Datos)
    df2 = pd.DataFrame(Datos2)

    dfs = pd.concat([df1, df2])

    return dfs

ex1_concat_same_structure()

        Nombre  Edad
0          Pao    21
1          Pau    20
2         Mech    20
3       Ani K.    23
0  Tom Holland    23
1         Josh    20
2          Ran    22
3   Diego Luna    22

In [ ]:
#Ejercicio 2:
# Tienes un DataFrame con ventas de enero y otro con ventas de febrero (mismas columnas). Concaténalos en un solo DataFrame y añade una columna que indique el mes original de cada fila (por ejemplo: 'Enero' o 'Febrero'). Retorna el DataFrame resultante.

import pandas as pd

def ex2_concat_with_month_column():
    
    enero = {
        'Producto': ['Queso', 'Leche Deslactosada', 'Crema deslactosada'],
        'Ventas': [4300, 2400, 3200]
    }
    febrero = {
        'Producto': ['Queso', 'Leche Deslactosada', 'Crema deslactosada'],
        'Ventas': [3600, 3000, 2100]
    }

    df_enero = pd.DataFrame(enero)
    df_febrero = pd.DataFrame(febrero)

    df_enero['Mes'] = 'Enero'
    df_febrero['Mes'] = 'Febrero'

    df_total = pd.concat([df_enero, df_febrero])
    return df_total

display(ex2_concat_with_month_column())

             Producto  Ventas      Mes
0               Queso    4300    Enero
1  Leche Deslactosada    2400    Enero
2  Crema deslactosada    3200    Enero
0               Queso    3600  Febrero
1  Leche Deslactosada    3000  Febrero
2  Crema deslactosada    2100  Febrero

In [34]:
# Ejercicio 3:
# Crea dos DataFrame que no tengan exactamente las mismas columnas (ej.: uno tiene 'Producto' y 'Ventas', el otro 'Producto' y 'Descuento'). Concaténalos y asegura que los valores faltantes queden rellenados con 0. Retorna el DataFrame resultante.

import pandas as pd


def ex3_concat_diff_columns_fillna():
    # Datos de enero y febrero
    enero = {
        'Producto': ['Queso', 'Leche Deslactosada', 'Crema deslactosada'],
        'Ventas': [4300, 2400, 3200]
    }
    febrero = {
        'Producto': ['Queso', 'Leche Deslactosada', 'Crema deslactosada'],
        'Descuentos': [100, 500, 300]
    }

    df_enero = pd.DataFrame(enero)
    df_febrero = pd.DataFrame(febrero)

    df_enero['Mes'] = 'Enero'
    df_febrero['Mes'] = 'Febrero'


    df_total = pd.concat([df_enero, df_febrero], ignore_index=True).fillna(0)

    return df_total

display(ex3_concat_diff_columns_fillna())

             Producto  Ventas      Mes  Descuentos
0               Queso  4300.0    Enero         0.0
1  Leche Deslactosada  2400.0    Enero         0.0
2  Crema deslactosada  3200.0    Enero         0.0
3               Queso     0.0  Febrero       100.0
4  Leche Deslactosada     0.0  Febrero       500.0
5  Crema deslactosada     0.0  Febrero       300.0

In [136]:
#Ejercicio 4: 
# Genera tres DataFrame pequeños (cada uno con, por ejemplo, 3 filas) que representen notas de distintos grupos de alumnos. Concaténalos verticalmente en un solo DataFrame que contenga todas las notas. Retorna el DataFrame resultante.


import pandas as pd

def ex4_concat_three_groups():
    Datos = {
        'Carrera': ['Neuro','Neuro','Neuro','Neuro'],
        'Nombre': ['Pao', 'Pau', 'Mech', 'Ani K.'],
        'Calificaciones': [8.8, 10, 9.98, 8.9]
    }

    Datos2 = {
        'Carrera': ['Tecno','Mate','Tecno','Neuro'],
        'Nombre': ['Victor', 'Josh', 'Ran', 'Rosa'],
        'Calificaciones': [9.9, 8, 9, 8.8]
    }
    
    Datos3 = {
        'Carrera': ['Tecno','Neuro','Neuro'],
        'Nombre': ['Maff', 'Maquita', 'Soff'],
        'Calificaciones': [9.1, 9.1, 9]
    }

    
    df1 = pd.DataFrame(Datos)
    df2 = pd.DataFrame(Datos2)
    df3 = pd.DataFrame(Datos3)
    
    df_total = pd.concat([df1, df2, df3], ignore_index=True)

    return df_total



resultado = ex4_concat_three_groups()
display(resultado)

   Carrera   Nombre  Calificaciones
0    Neuro      Pao            8.80
1    Neuro      Pau           10.00
2    Neuro     Mech            9.98
3    Neuro   Ani K.            8.90
4    Tecno   Victor            9.90
5     Mate     Josh            8.00
6    Tecno      Ran            9.00
7    Neuro     Rosa            8.80
8    Tecno     Maff            9.10
9    Neuro  Maquita            9.10
10   Neuro     Soff            9.00

#### 5-8: Listas

In [53]:
# Ejercicio 5:
# Dada una lista de enteros (o strings) que puede contener duplicados, devuelve una nueva lista sin duplicados preservando el orden original. No uses directamente set() para eliminar duplicados (escribe la lógica que preserve el orden). Retorna la nueva  lista sin duplicados.

def ex5_remove_duplicates_preserve_order(lst):
    Animales_sin_repetir=[]
    for item in lst:
     if item not in Animales_sin_repetir:
        Animales_sin_repetir.append(item)
    return Animales_sin_repetir

animales = ['perro', 'gato', 'vaquita', 'perro', 'oveja', 'gato', 'perro', 
            'vaquita', 'cerdo', 'caballo', 'gato', 'vaquita', 'gallo', 
            'oveja', 'perro', 'oso', 'tigre', 'oveja', 'oso', 'gallo', 'Pollito Pio', 'tigre']

ex5_remove_duplicates_preserve_order(animales)

['perro',
 'gato',
 'vaquita',
 'oveja',
 'cerdo',
 'caballo',
 'gallo',
 'oso',
 'tigre',
 'Pollito Pio']

In [54]:
# Ejercicio 6:
# Dada una lista de tuplas, por ejemplo [("a", 3), ("b", 1), ("c", 2)], ordénala por el segundo elemento de cada tupla y devuelve la lista ordenada. Usa una función anónima si lo deseas. Retorna la lista ordenada.

def ex6_sort_tuples_by_second_element(tuples_list):
    
    lista_ordenada = sorted (tuples_list, key=lambda x:x[1])
    return lista_ordenada

tuples_list=([("a", 3), 
              ("b", 1),
              ("c", 2)])

ex6_sort_tuples_by_second_element(tuples_list)

[('b', 1), ('c', 2), ('a', 3)]

In [58]:
# Ejercicio 7: 
# Devuelve una lista con los primeros n múltiplos de 7 (por ejemplo, n=5 -> [7,14,21,28,35]). Retorna la lista generada.

def ex7_first_n_multiples_of_7(n):
    multiplos=[]
    for i in range (1,n+1):
        multiplos.append(7*i)
    return multiplos

ex7_first_n_multiples_of_7(5)

[7, 14, 21, 28, 35]

In [137]:
# Ejercicio 8: 
# Dada una lista de cadenas, devuelve sólo aquellas que son palíndromos (se leen igual al derecho y al revés). Retorna una lista con los palíndromos encontrados.

def ex8_palindromes(lista_cadenas):
    return [p for p in lista_cadenas if p.replace(" ", "") == p.replace(" ", "")[::-1]]

cadenas = ['solos', 'brillas', 'cerebelo', 'corteza', 'seres', 'pelon', 'oso', 'radar', 'carro', 'amor a roma', 'lindo']

ex8_palindromes(cadenas)

['solos', 'seres', 'oso', 'radar', 'amor a roma']

#### 9-12: Conjuntos

In [60]:
# Ejercicio 9:
# Dado dos conjuntos, devuelve su intersección y la diferencia (elementos de A que no están en B). Retorna una tupla (intersección, diferencia)

def ex9_set_intersection_and_difference(set_a, set_b):
    interseccion = set_a & set_b
    diferencia = set_a - set_b
    return (interseccion, diferencia)

set_a={1,2,3,4}
set_b={2,7,4,9}
ex9_set_intersection_and_difference(set_a, set_b)

({2, 4}, {1, 3})

In [ ]:
# Ejercicio 10: 
# Verifica si set_a es subconjunto de set_b. Devuelve True o False.

def ex10_is_subset(set_a, set_b):
    return set_a.issubset(set_b)
ex10_is_subset(set_a, set_b)

False

In [ ]:
# Ejercicio 11: 
# Dada una lista, cuenta cuántos elementos únicos contiene (usa set para obtener el conteo). Retorna el número de elementos únicos.
def ex11_count_unique_elements(lst):
    elementos_unicos= set(lst)
    return len(elementos_unicos)

lst=[1,3,2,3,1,4,3,2,2,4,3,5]
ex11_count_unique_elements(lst)

5

In [67]:
#Ejercicio 12:
    # Dada una lista de frases (strings), extrae y devuelve el conjunto de todas las palabras únicas que aparecen en todas las frases. Retorna un conjunto con las palabras únicas.
def ex12_unique_words_from_phrases(phrases):
    palabras_unicas = set()
    for frase in phrases:
        palabras = frase.split()
        palabras_unicas.update(palabras)
    return palabras_unicas

phrases = [
    """ And I'm living off of grass, and the drippings from my ceiling
    It's okay to eat fish 'cause they don't have any feelings
    Something in the way, hmm-mmm
    Something in the way, yeah, hmm-mmm
    Something in the way, hmm-mmm
    Something in the way, yeah, hmm-mmm
    Something in the way, hmm-mmm
    Something in the way, yeah, hmm-mmm"""
]

print(ex12_unique_words_from_phrases(phrases))

{'living', 'in', 'drippings', "don't", 'to', 'grass,', 'have', "I'm", 'eat', "'cause", 'and', 'the', 'off', 'from', 'of', 'fish', 'way,', 'yeah,', 'ceiling', 'they', 'Something', 'hmm-mmm', 'any', 'And', 'my', "It's", 'okay', 'feelings'}

#### Tuplas

In [138]:
#Ejercicio 13:
# Recibe una lista de tuplas (nombre, edad). Devuelve la tupla de la persona con mayor edad.

def ex13_oldest_person(tuple_list):
   if not tuple_list:
    return None 
   return max(tuple_list, key = lambda x:x[1])

tuple_list = [('Victor', 26), ("Paola",21), ("Mech", 20), ('Ran', 22), ("Pau", 20), ('Josh',  20)]

ex13_oldest_person(tuple_list)

('Victor', 26)

In [139]:
# Ejercicio 14: 
# Convierte una lista de listas en una lista de tuplas. Retorna la nueva lista de tuplas.

def ex14_convert_list_of_lists_to_tuples(list_of_lists):
    return [tuple(sublista) for sublista in list_of_lists]

list_of_lists = [[ 'gato','gata'],['yo','el','no'],['infiel','perro']]
ex14_convert_list_of_lists_to_tuples(list_of_lists)

[('gato', 'gata'), ('yo', 'el', 'no'), ('infiel', 'perro')]

In [72]:
# Ejercicio 15:
# Recibe una tupla de tres números (a, b, c). Desempaquétala y devuelve la suma a+b+c. Retorna un número entero o flotante.

def ex15_sum_of_tuple_abc(t):
    a,b,c = t
    return a+b+c

t=[1,2,3]
ex15_sum_of_tuple_abc(t)

6

In [82]:
# Ejercicio 16:
# Dada una lista de tuplas (producto, precio), ordénala por precio de menor a mayor.Retorna la lista ordenada.

def ex16_sort_product_price(prod_price_list):
    return sorted(prod_price_list, key=lambda producto: producto[1])

prod_price_list = [
    ("Airen de la rosa de guadalupe", 60),
    ("fantasma atarpado en una botella", 85),
    ("Tierra extraida de donde fue secreto en la montaña ", 100),
    ("El cafe adiccitivo(el de sus ojos)", 1000)
]

df = pd.DataFrame(ex16_sort_product_price(prod_price_list), columns=["Producto", "Precio"])
display(df)

                                            Producto  Precio
0                      Airen de la rosa de guadalupe      60
1                   fantasma atarpado en una botella      85
2  Tierra extraida de donde fue secreto en la mon...     100
3                 El cafe adiccitivo(el de sus ojos)    1000

#### Diccionarios

In [83]:
# Ejercicio 17:
# Cuenta la frecuencia de cada carácter en una cadena usando un diccionario. Retorna un diccionario {carácter: frecuencia}.

def ex17_char_frequency(s):
    frecuencia = {}
    for char in s:
        if char in frecuencia:
            frecuencia[char] += 1
        else:
            frecuencia[char] = 1
    return frecuencia

s="""cucarachaTe miro distraído, inconsciente de mi mirada
Y al notarme, tus ojos miran a los míos de tal modo
Que pareciera que ves a la nada
Mientras yo, lo veo a mi todo"""
ex17_char_frequency(s)

{'c': 6,
 'u': 4,
 'a': 19,
 'r': 9,
 'h': 1,
 'T': 1,
 'e': 13,
 ' ': 29,
 'm': 8,
 'i': 10,
 'o': 15,
 'd': 8,
 's': 8,
 't': 7,
 'í': 2,
 ',': 3,
 'n': 7,
 '\n': 3,
 'Y': 1,
 'l': 5,
 'j': 1,
 'Q': 1,
 'p': 1,
 'q': 1,
 'v': 2,
 'M': 1,
 'y': 1}

In [ ]:
# Ejercicio 18:
# Dado un diccionario {alumno: calificación}, devuelve al mejor estudiante. Retorna una tupla (nombre, calificación).
def ex18_best_student(grades_dict):
    mejor_nota= max(grades_dict.items(), key=lambda x:x[1])
    return mejor_nota

grades_dict = {
    "Paola": 8.9, 
    "Mech": 9.2, 
    "Pau": 8.9, 
    "Ana K": 9.5
    }

ex18_best_student(grades_dict)

('Ana K', 9.5)

In [87]:
# Ejercicio 19: 
# Invierte un diccionario, intercambiando claves y valores. Retorna el diccionario invertido.

def ex19_invert_dictionary(d):
    dicc_invertido = {valor: clave for clave, valor in d.items()}
    return dicc_invertido

d={"Mandarina":5, "Platano":2,"Sandia":3,"Uvas":4}
ex19_invert_dictionary(d)

{5: 'Mandarina', 2: 'Platano', 3: 'Sandia', 4: 'Uvas'}

In [88]:
# Ejercicio 20:
# Fusiona dos diccionarios sumando los valores de las claves que se repitan. Devuelve el diccionario resultante.

def ex20_merge_dicts_sum_values(d1, d2):
    resultado= d1.copy()
    for clave, valor in d2.items():
        resultado[clave] = resultado.get(clave,0)+valor
    return resultado

d1 = {"manzanas": 10, "naranjas": 5, "plátanos": 7}
d2 = {"naranjas": 3, "plátanos": 2, "peras": 8}

ex20_merge_dicts_sum_values(d1, d2)

{'manzanas': 10, 'naranjas': 8, 'plátanos': 9, 'peras': 8}

#### Numpy

In [90]:
import numpy as np

In [91]:
# Ejercicio 21:
#Crea un arreglo de NumPy de 10 ceros y cambia el quinto elemento (índice 4) a 1.Retorna el array resultante.

def ex21_numpy_array_set_fifth():
    
    arreglo=np.zeros(10)
    arreglo[4] =1
    return arreglo

ex21_numpy_array_set_fifth()

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [93]:
#Ejercicio 22:
#Genera una matriz 3x3 con los valores del 0 al 8. Retorna la matriz como array de NumPy.

def ex22_numpy_matrix_3x3():
    matriz = np.arange(9).reshape(3, 3)
    return matriz

ex22_numpy_matrix_3x3()

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [100]:
#Ejercicio 23:
# Genera un array aleatorio de 20 enteros y calcula la media, mediana y desviación estándar.Retorna una tupla (media, mediana, desviación estándar).

def ex23_numpy_statistics():
    
    array_al=np.random.randint(0,100,20)
    media=np.mean(array_al)
    mediana=np.median(array_al)
    desviacion=np.std(array_al)
    return (media, mediana, desviacion)

ex23_numpy_statistics()

(np.float64(41.0), np.float64(41.0), np.float64(26.668333281253254))

In [102]:
# Ejercicio 24:
#Dado un array (o lista) de números, reemplaza todos los valores mayores que 10 por 10 (es decir, limita/"clip" los valores máximos)Retorna el array modificado.

def ex24_numpy_clip_values(arr):
    arr=np.array(arr)
    arr=np.clip(arr,None,10)
    return arr

arr=[6,6,6,7,8,10, 66, 666]
ex24_numpy_clip_values(arr)

array([ 6,  6,  6,  7,  8, 10, 10, 10])

#### Pandas

In [105]:
# Ejercicio 25:
# Crea un DataFrame con columnas 'Nombre', 'Edad' y 'Ciudad'. Filtra y retorna solo las filas con `Edad` > 30.

def ex25_filter_rows_age_over_30():
    df = pd.DataFrame({
        'Nombre': ['Pao', 'Pau', 'Mechh', 'Ana K.', 'Chito'],
        'Edad': [31, 29, 30, 33, 4],
        'Ciudad': ["Zacatecas", "Ecatepec", "Orizaba", "CuernaMoo", "Jerez"]
    })
    df_filtrado = df[df['Edad']>30]
    return df_filtrado

ex25_filter_rows_age_over_30()

   Nombre  Edad     Ciudad
0     Pao    31  Zacatecas
3  Ana K.    33  CuernaMoo

In [113]:
# Ejercicio 26:
# Carga un diccionario en un DataFrame (por ejemplo {'Nombre': [...],'Puntaje': [...]}) y ordénalo por la columna de puntaje de mayor a menor.Retorna el DataFrame ordenado.

def ex26_load_dict_into_dataframe_and_sort():
    return pd.DataFrame({'Nombre':['Pau', 'Mech', 'Ana', 'Chito', 'Shippu'],
                         'Puntaje':[92,88,82,100,99]}).sort_values(by='Puntaje',ascending=False)
    
ex26_load_dict_into_dataframe_and_sort()

   Nombre  Puntaje
3   Chito      100
4  Shippu       99
0     Pau       92
1    Mech       88
2     Ana       82

In [115]:
# Ejercicio 27:
# Dado un DataFrame con columnas 'Grupo' y 'Valor', calcula el promedio de 'Valor' por cada 'Grupo' usando groupby. Retorna el DataFrame agrupado con promedios.

def ex27_groupby_mean_value():
    df = pd.DataFrame({
        'Producto': ['Pan', 'Leche', 'Pan', 'Leche', 'Café', 'Pan'],
        'Valor': [15, 26, 32, 39, 42, 55]
    })
    df_promedio = df.groupby('Producto', as_index=False)['Valor'].mean()
    return df_promedio

ex27_groupby_mean_value()

  Producto  Valor
0     Café   42.0
1    Leche   32.5
2      Pan   34.0

In [118]:
# Ejercicio 28:
# Dado un DataFrame de ventas con columnas 'Producto' y 'Cantidad', determina cuál es el producto con la mayor suma total de 'Cantidad' (es decir, el más vendido). Retorna una tupla (Producto, Ventas)

def ex28_most_sold_product_from_sales_df():
    df = pd.DataFrame({
        'Producto': ['Pan', 'Leche', 'Pan', 'Huevos', 'Café', 'Pan'],
        'Cantidad': [30, 50, 20, 40, 60, 25]
    })
    ventas_totales = df.groupby('Producto')['Cantidad'].sum()
    producto_max = ventas_totales.idxmax()
    cantidad_max = ventas_totales.max()
    
    return (producto_max, cantidad_max)
    return df_promedio

ex28_most_sold_product_from_sales_df()

('Pan', np.int64(75))

#### Lambdas y funciones anónimas

In [126]:
# Ejercicio 29:
# Usa map junto con una función lambda para elevar al cubo cada número en una lista. Devuelve la lista resultante.

def ex29_map_lambda_cube(lst):
    return list(map(lambda x: x**3, lst))

lst=[0,1,2,4,6,8]
ex29_map_lambda_cube(lst)

[0, 1, 8, 64, 216, 512]

In [127]:
# Ejercicio 30: 
# Usa filter y una lambda para quedarte sólo con los números pares de una lista. Devuelve la lista filtrada.

def ex30_filter_lambda_even(lst):
    return list(filter(lambda x:x % 2 == 0, lst))

lst =[5,7,4,9,7,6, 11, 7,2]
ex30_filter_lambda_even(lst)

[4, 6, 2]

In [130]:
# Ejercicio 31:
# Dada una lista de diccionarios, ordénala por el valor asociado a 'keyname' usando sorted con una lambda. Devuelve la lista ordenada.
def ex31_sort_list_of_dicts_by_key(lst, keyname):
    return sorted(lst, key=lambda d: d[keyname])

lst = [
    {'nombre': 'Pao', 'edad': 21},
    {'nombre': 'Mech', 'edad': 20},
    {'nombre': 'Pau', 'edad': 20},
    {'nombre': 'Ana', 'edad': 23}
]

resultado = ex31_sort_list_of_dicts_by_key(lst, 'edad')
display(resultado)

[{'nombre': 'Mech', 'edad': 20},
 {'nombre': 'Pau', 'edad': 20},
 {'nombre': 'Pao', 'edad': 21},
 {'nombre': 'Ana', 'edad': 23}]

In [131]:
# Ejercicio 32:
# Crea un DataFrame con una columna 'Nombre' a partir de names_list y usa apply con una función lambda para crear una nueva columna con los nombres en mayúsculas. Devuelve el DataFrame modificado.

def ex32_pandas_apply_lambda_uppercase(names_list):
    df = pd.DataFrame({'Nombre': names_list})
    df['Nombre_Mayus'] = df['Nombre'].apply(lambda x: x.upper())
    return df

names_list=['Pao','Mech','Pau','Ana']
ex32_pandas_apply_lambda_uppercase(names_list)

  Nombre Nombre_Mayus
0    Pao          PAO
1   Mech         MECH
2    Pau          PAU
3    Ana          ANA